#+title: 作ったElispパッケージとその展望
#+subtitle: leaf.el, seml-mode.el, flylint.el
#+author: 山下 直哉 (@conao3)
#+date: 2019-09-28
#+tags: emacs, lisp, leaf.el, seml-mode.el, flylint.el

#+reveal_root: ../

#+reveal_miscinfo: 東京Emacs勉強会 - 菊の節句 at LINE株式会社
#+options: toc:1 num:nil
#+options: reveal_control:nil reveal_width:1200 reveal_height:800

* init                                                             :noexport:
#+begin_src emacs-lisp
  (unless (file-directory-p "~/dev/forks/reveal.js/slide")
    (shell-command "ln -s ../../repos/orglyth-src/src/slide/"))

  (let ((default-directory "~/dev/forks/reveal.js"))
    (shell-command "npm install && npm start &"))

  (browse-url "http://localhost:8000/slide/")
#+end_src

#+RESULTS:
: #<process open http://localhost:8000/slide/>

